import java.util.Scanner;

public class Main2 {
    public static void main(String[] args) {
        // Создание объекта Scanner для чтения ввода с клавиатуры
        Scanner scanner = new Scanner(System.in);

        // Введите данные с клавиатуры
        System.out.print("Введите кількість робочих годин на тиждень: ");
        double b1 = scanner.nextInt(); // Чтение целочисленного значения

        System.out.print("Введите річна зарплатня з податками: ");
        double b2 = scanner.nextDouble(); // Чтение значения с плавающей точкой

        System.out.print("Введите вісоток податку: ");
        double b3 = scanner.nextDouble(); // Чтение значения с плавающей точкой
        // Печать введенных данных
        System.out.println("Вы ввели кількість робочих годин на тиждень " + b1 + ", річна зарплатня з податками " + b2 + "баксов, вісоток податку " + b3 + "%.");

        // Закрытие сканера после использования
        scanner.close();
              //Розрахувати місячну і річну зарплатню з податками та без
        //кількість робочих годин на тиждень
       // double b1 = 40;
        //річна зарплатня з податками
      //  double b2  = 120000;
        //вісоток податку
     //   double b3  = 25;
        //расчет
        double s1=b2/12/4/b1;
        double s2=(b2/12)*((100-b3)/100);


        // Вивести в консоль за прикладом

        System.out.println ("При "+b1+" робочих годин на тиждень з річною зарплатею в "+b2+" та податком " +b3+"%  година часу коштує "+s1+"баксов. Зарплатня на місяць без податків: " +s2);






    }
}
